grevaillot/svd_tools/headers/ATSAMV71Q21B/pioa.h
/** PIOA_PIO_ELSR_P31 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P31		(1 << 31)
/** PIOA_PIO_ELSR_P30 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P30		(1 << 30)
/** PIOA_PIO_ELSR_P29 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P29		(1 << 29)
/** PIOA_PIO_ELSR_P28 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P28		(1 << 28)
/** PIOA_PIO_ELSR_P27 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P27		(1 << 27)
/** PIOA_PIO_ELSR_P26 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P26		(1 << 26)
/** PIOA_PIO_ELSR_P25 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P25		(1 << 25)
/** PIOA_PIO_ELSR_P24 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P24		(1 << 24)
/** PIOA_PIO_ELSR_P23 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P23		(1 << 23)
/** PIOA_PIO_ELSR_P22 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P22		(1 << 22)
/** PIOA_PIO_ELSR_P21 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P21		(1 << 21)
/** PIOA_PIO_ELSR_P20 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P20		(1 << 20)
/** PIOA_PIO_ELSR_P19 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P19		(1 << 19)
/** PIOA_PIO_ELSR_P18 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P18		(1 << 18)
/** PIOA_PIO_ELSR_P17 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P17		(1 << 17)
/** PIOA_PIO_ELSR_P16 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P16		(1 << 16)
/** PIOA_PIO_ELSR_P15 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P15		(1 << 15)
/** PIOA_PIO_ELSR_P14 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P14		(1 << 14)
/** PIOA_PIO_ELSR_P13 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P13		(1 << 13)
/** PIOA_PIO_ELSR_P12 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P12		(1 << 12)
/** PIOA_PIO_ELSR_P11 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P11		(1 << 11)
/** PIOA_PIO_ELSR_P10 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P10		(1 << 10)
/** PIOA_PIO_ELSR_P9 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P9		(1 << 9)
/** PIOA_PIO_ELSR_P8 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P8		(1 << 8)
/** PIOA_PIO_ELSR_P7 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P7		(1 << 7)
/** PIOA_PIO_ELSR_P6 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P6		(1 << 6)
/** PIOA_PIO_ELSR_P5 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P5		(1 << 5)
/** PIOA_PIO_ELSR_P4 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P4		(1 << 4)
/** PIOA_PIO_ELSR_P3 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P3		(1 << 3)
/** PIOA_PIO_ELSR_P2 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P2		(1 << 2)
/** PIOA_PIO_ELSR_P1 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P1		(1 << 1)
/** PIOA_PIO_ELSR_P0 Edge/Level Interrupt Source Selection **/
#define PIOA_PIO_ELSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_fellsr PIOFELLSR Falling Edge/Low-Level Select Register
@{*/

/** PIOA_PIO_FELLSR_P31 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P31		(1 << 31)
/** PIOA_PIO_FELLSR_P30 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P30		(1 << 30)
/** PIOA_PIO_FELLSR_P29 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P29		(1 << 29)
/** PIOA_PIO_FELLSR_P28 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P28		(1 << 28)
/** PIOA_PIO_FELLSR_P27 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P27		(1 << 27)
/** PIOA_PIO_FELLSR_P26 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P26		(1 << 26)
/** PIOA_PIO_FELLSR_P25 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P25		(1 << 25)
/** PIOA_PIO_FELLSR_P24 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P24		(1 << 24)
/** PIOA_PIO_FELLSR_P23 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P23		(1 << 23)
/** PIOA_PIO_FELLSR_P22 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P22		(1 << 22)
/** PIOA_PIO_FELLSR_P21 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P21		(1 << 21)
/** PIOA_PIO_FELLSR_P20 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P20		(1 << 20)
/** PIOA_PIO_FELLSR_P19 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P19		(1 << 19)
/** PIOA_PIO_FELLSR_P18 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P18		(1 << 18)
/** PIOA_PIO_FELLSR_P17 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P17		(1 << 17)
/** PIOA_PIO_FELLSR_P16 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P16		(1 << 16)
/** PIOA_PIO_FELLSR_P15 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P15		(1 << 15)
/** PIOA_PIO_FELLSR_P14 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P14		(1 << 14)
/** PIOA_PIO_FELLSR_P13 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P13		(1 << 13)
/** PIOA_PIO_FELLSR_P12 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P12		(1 << 12)
/** PIOA_PIO_FELLSR_P11 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P11		(1 << 11)
/** PIOA_PIO_FELLSR_P10 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P10		(1 << 10)
/** PIOA_PIO_FELLSR_P9 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P9		(1 << 9)
/** PIOA_PIO_FELLSR_P8 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P8		(1 << 8)
/** PIOA_PIO_FELLSR_P7 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P7		(1 << 7)
/** PIOA_PIO_FELLSR_P6 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P6		(1 << 6)
/** PIOA_PIO_FELLSR_P5 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P5		(1 << 5)
/** PIOA_PIO_FELLSR_P4 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P4		(1 << 4)
/** PIOA_PIO_FELLSR_P3 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P3		(1 << 3)
/** PIOA_PIO_FELLSR_P2 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P2		(1 << 2)
/** PIOA_PIO_FELLSR_P1 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P1		(1 << 1)
/** PIOA_PIO_FELLSR_P0 Falling Edge/Low-Level Interrupt Selection **/
#define PIOA_PIO_FELLSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_rehlsr PIOREHLSR Rising Edge/High-Level Select Register
@{*/

/** PIOA_PIO_REHLSR_P31 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P31		(1 << 31)
/** PIOA_PIO_REHLSR_P30 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P30		(1 << 30)
/** PIOA_PIO_REHLSR_P29 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P29		(1 << 29)
/** PIOA_PIO_REHLSR_P28 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P28		(1 << 28)
/** PIOA_PIO_REHLSR_P27 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P27		(1 << 27)
/** PIOA_PIO_REHLSR_P26 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P26		(1 << 26)
/** PIOA_PIO_REHLSR_P25 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P25		(1 << 25)
/** PIOA_PIO_REHLSR_P24 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P24		(1 << 24)
/** PIOA_PIO_REHLSR_P23 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P23		(1 << 23)
/** PIOA_PIO_REHLSR_P22 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P22		(1 << 22)
/** PIOA_PIO_REHLSR_P21 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P21		(1 << 21)
/** PIOA_PIO_REHLSR_P20 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P20		(1 << 20)
/** PIOA_PIO_REHLSR_P19 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P19		(1 << 19)
/** PIOA_PIO_REHLSR_P18 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P18		(1 << 18)
/** PIOA_PIO_REHLSR_P17 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P17		(1 << 17)
/** PIOA_PIO_REHLSR_P16 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P16		(1 << 16)
/** PIOA_PIO_REHLSR_P15 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P15		(1 << 15)
/** PIOA_PIO_REHLSR_P14 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P14		(1 << 14)
/** PIOA_PIO_REHLSR_P13 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P13		(1 << 13)
/** PIOA_PIO_REHLSR_P12 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P12		(1 << 12)
/** PIOA_PIO_REHLSR_P11 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P11		(1 << 11)
/** PIOA_PIO_REHLSR_P10 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P10		(1 << 10)
/** PIOA_PIO_REHLSR_P9 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P9		(1 << 9)
/** PIOA_PIO_REHLSR_P8 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P8		(1 << 8)
/** PIOA_PIO_REHLSR_P7 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P7		(1 << 7)
/** PIOA_PIO_REHLSR_P6 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P6		(1 << 6)
/** PIOA_PIO_REHLSR_P5 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P5		(1 << 5)
/** PIOA_PIO_REHLSR_P4 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P4		(1 << 4)
/** PIOA_PIO_REHLSR_P3 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P3		(1 << 3)
/** PIOA_PIO_REHLSR_P2 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P2		(1 << 2)
/** PIOA_PIO_REHLSR_P1 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P1		(1 << 1)
/** PIOA_PIO_REHLSR_P0 Rising Edge/High-Level Interrupt Selection **/
#define PIOA_PIO_REHLSR_P0		(1 << 0)

/**@}*/

/** @defgroup pioa_pio_frlhsr PIOFRLHSR Fall/Rise - Low/High Status Register
@{*/

